print ("Бидний сонирхолтой гариг танин мэдэхүйн зохиолд тавтай морил! Бид таны өгсөн үгсээр сонирхолтой зүйл зохиох болно.")
player_name = input("Нэрийг тань хэн гэдэг вэ? ")
place = input("таны амьдарч буй гаригийн нэр юу вэ? ")
location = input("Нарны аймгийн хэддэх гариг вэ? ")
percentage = input("Гаригийн тань хэдэн хувь ус вэ? ")
possible = input("Амьдрал байх боломжтой юу? ")
story = f"""Энэ хүртэл хариулж чадсан, {player_name.upper()} нэртэй та тун гайхалтай. Амьдрал тэтгэх одноосоо {location} дахь гариг мөн гадаргийн {percentage} хувь ус гэдэг нь амьдрал байх боломжийг {possible.lower()} гэж үзэх хангалттай шалтгаан билээ. """
print (story)   


